---
kind: method
id: M:Autodesk.Revit.DB.Parameter.AsValueString
zh: 参数、共享参数
source: html/5015755d-ee80-9d74-68d9-55effc60ed0c.htm
---
# Autodesk.Revit.DB.Parameter.AsValueString Method

**中文**: 参数、共享参数

Get the parameter value as a string with units.

## Syntax (C#)
```csharp
public string AsValueString()
```

## Returns
The string that represents the parameter value.